#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
random_password.flyte_db_password: Refreshing state... [id=none]
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
data.google_client_config.default: Reading...
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_container_cluster.flyte_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]
google_container_node_pool.flyte_node_pool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster/nodePools/flyte-np]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.flyte_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_cluster" {
      ~ cluster_ipv4_cidr           = "10.0.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "34.73.70.81" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/zones/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.3.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRQmNuMVYvNDJydGVmTXdscWgwVVZmVEFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSak1UUmpNamcwWmkxa01qUXhMVFJoT1RNdFlUZ3pOaTAyTnpWaU5EYzBOakExWlRBdwpJQmNOTWpNd056RTJNVE0wTVRReldoZ1BNakExTXpBM01EZ3hORFF4TkROYU1DOHhMVEFyQmdOVkJBTVRKR014Ck5HTXlPRFJtTFdReU5ERXROR0U1TXkxaE9ETTJMVFkzTldJME56UTJNRFZsTURDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQUwxaGdqVkNBQ3dQc3czK09lcGg5LzRlU1RHd0NzU3hrWGdNSFIvRQp3bzYwUHFVZDJDY2xRR1ZjeXd2TzNsUytUQUJjRWhlZkpTMUNMalliMkVWSW5UNVNOUVR0TkFPdVlzTld2VDVTCklMRktqcXNZWGdRcGcvWmJadzArQThKR241bnFRaTlLeDNlaHliSTJlcXFVOTYxOGdJbm1BUERaUGJIWDMvU0kKM0RGNmZjdm1DdVVpdVNvWW15bU9ySWRVVTNrVGlaRkVFWklqWDd2NE9ERVl2a3YwakxMNjlwZlpGYnEvMHNVVApaVnd0NTBtZ3Zlc1ZuYzhkM1VJM3J6UTRUMDQxSkp5RkJsQWZtSi8zOU85bWY3eG5VeFM1WTdsWGZPWDl0eVVGClR2cEIvZTdPSXZ3bjVBN2Z6c1lYV05sQ2Z4N0pXakdEejlDbzk0VXZWRStkK0h2ek1Md2pROVpCY2NRMnkwUlUKTlM0ZmorL2RaSnM1dGZzczdYWWtLUWUwMmlOb3dVQUFBMXl2YlZONEtpTFYvdlJNck5acG40VXNFeE9LSG1KTgpOMDZ0TG1CZStvWjBuK3p6ZnNoejcyakpKWjN1V3I5SWxhMkNmQVhhRFBDWEVkV2lKa053S09rRXdMTmR6Ny9VClgyZ3c4a0NGT0gzajhOSEdhWVNWdElLN3BRSURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVUzYjNud2xESFcrSDBaa0tZTk9Qbkg0MlZFcTR3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFENlJ0TGxqQnZFK1RLb0FpbTFCQzYvZk96Q2ZubW1TYkZ1WkZlSHN2Um1JCnhHTTU3MGRPcWdVR1lVaWF2a3VhL2kxMzc3d1RHclpFNnl4SGJ0RzR5elV5aXJRQUliUjVCaTAvbWRMdWFKQlgKWHhYNUZxUWt3SlZCNkxHMDAwQlA2aGhwV2tsS2hybjBGVndaQzhUS2ladmxZZGRKU3RDVXpEd3crVGErdUdTNApXZUpyUjVabk4zWVloOFpvdm0rWmd0TFNxbmYzeXd4UzVxSk1mRGhYVkY3bFNkUDhvRFdhSTJ5OHUxYjBtME9wCjlyUlVjVkc4VDJYWFVHT2p6TzlpUlJLUXdITERsbUtWeDUyVjF4OW95dEVIYnd2QTF4dTEzd2J4KzBhaGhqNnIKUEEwLzZqVUdUVFFhSWtnWC9SR1dzOXFTd2F6djI0SnViUHF2d0RKQXNRUjcrdzRtenRYTUl2djB4cVJuaE92TAptalgwUFJIVTIwbWVLMkdib0UydzNoTlgrMmtsUllUdUFpbjVQTW9JVk9LeFNKWHJpS0NHU3ZkWnhQenNFc0s5CjVxajVNRTlrTm1jcW1UekJRY0N5OHZkQm41em5vMTlLMVlYbGo3MGxoTXRVZWIrc29QTXJ0SUdwMW1GZEVZNCsKQVc2ZUltSlJjZTdKaEt1M3RjUTJudz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

            # (1 unchanged block hidden)
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> 10 # forces replacement
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-micro" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> (known after apply)
          ~ preemptible       = true -> false # forces replacement
          - resource_labels   = {} -> null
          ~ service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (3 unchanged attributes hidden)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 0 # forces replacement
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - node_pool {
          - initial_node_count          = 2 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroupManagers/gke-flyte-cluster-flyte-np-acee24f6-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroups/gke-flyte-cluster-flyte-np-acee24f6-grp",
            ] -> null
          - max_pods_per_node           = 0 -> null
          - name                        = "flyte-np" -> null
          - node_count                  = 2 -> null
          - node_locations              = [
              - "us-east1-b",
            ] -> null
          - version                     = "1.26.5-gke.1200" -> null

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "e2-micro" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = true -> null
              - resource_labels   = {} -> null
              - service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
              - spot              = false -> null
              - tags              = [] -> null
              - taint             = [] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.54" -> null
          - public_endpoint         = "34.73.70.81" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }

        # (1 unchanged block hidden)
    }

  # google_container_node_pool.flyte_node_pool must be replaced
-/+ resource "google_container_node_pool" "flyte_node_pool" {
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster/nodePools/flyte-np" -> (known after apply)
      ~ initial_node_count          = 2 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroupManagers/gke-flyte-cluster-flyte-np-acee24f6-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroups/gke-flyte-cluster-flyte-np-acee24f6-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "flyte-np"
      + name_prefix                 = (known after apply)
      ~ node_locations              = [
          - "us-east1-b",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      ~ version                     = "1.26.5-gke.1200" -> (known after apply)
        # (3 unchanged attributes hidden)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 4
          + min_node_count  = 2
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-micro" -> "e2-medium" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
          - tags              = [] -> null
          ~ taint             = [ # forces replacement
              + {
                  + effect = "NO_SCHEDULE" # forces replacement
                  + key    = "instance_type" # forces replacement
                  + value  = "spot" # forces replacement
                },
            ]
            # (5 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*